# 패키지 임포트
# 경로 설정을 위한 os 패키지 임포트
# 파이토치 패키지 임포트
# 이미지를 다루기 위한 PIL 패키지 임포트
# 하이퍼파라미터를 받기 위한 함수 임포트
# 하이퍼파라미터를 불러오기 위한 함수 임포트
# MLP 클래스 임포트
# LeNet 클래스 임포트
# 데이터를 불러오기 위한 함수 임포트

# 메인 함수 정의
    # 하이퍼파라미터 받기
    
    # 타겟 폴더와 타겟 이미지가 존재하는지 확인
    
    # 하이퍼파라미터 불러오기
          
    # 모델 객체 만들기

    # 저장된 모델 가중치 불러오기
    # 모델 가중치 불러오기
        # 경로 설정
        # 가중치가 저장된 경로
        
    # 모델에 가중치 저장

    # 추론할 이미지 불러오기

    # 이미지를 모델에 입력할 수 있는 형태로 변환
    # 이미지를 변환하기 위한 함수 불러오기
    # 이미지를 디바이스에 올리기
    # 이미지 차원 늘리기

    # 모델에 이미지 입력 후 출력값 저장
    
    # 출력값 중 가장 큰 값의 인덱스를 추론 결과로 저장

    # 추론 결과 출력

# 이 파일이 메인 파일이면 main 함수 실행